import move_limit, rooms1, floor, item, 도마


def 칸1():
    #날고기
    if (floor.count1==0):
        floor.count1+=1
        print(f'----------------------------------')
        print(f'『날고기』를 발견했다.')
        print(f'【item】 날고기를 얻었다!')
        print(f'----------------------------------')
        floor.heal_item.insert(1,'날고기')

        도마.냉장고()
    else:
        print(f'----------------------------------')
        print(f'첫번째 칸은 비어있다.')
        print(f'----------------------------------')
        도마.냉장고()


def 칸2():

    #썩은생선
    if (floor.count2==0):
        floor.count2+=1
        print(f'----------------------------------')
        print(f'『썩은생선』을 발견했다. 위험해보인다. 혹시모르니 챙겨두자')
        print(f'【item】 썩은생선을 얻었다!')
        print(f'----------------------------------')
        floor.heal_item.insert(2,'썩은생선')

        도마.냉장고()
    else:
        print(f'----------------------------------')
        print(f'두번째 칸은 비어있다.')
        print(f'----------------------------------')
        도마.냉장고()


def 칸3():

    #난도질된 시체조각
    if (floor.count3==0):
        floor.count3+=1
        print(f'----------------------------------')
        print(f'『난도질된 시체조각』을 발견했다. 먹어도...되는걸까..? 정말진짜혹시제발모르니까 챙겼다.')
        print(f'내가 생각하는 그런일이 일어나질 않기를...\n')
        print(f'【item】 난도질된 시체조각을 얻었다!')
        print(f'----------------------------------')
        floor.heal_item.insert(3,'난도질된 시체조각')

        도마.냉장고()
    else:
        print(f'----------------------------------')
        print(f'세번째 칸은 비어있다.')
        print(f'----------------------------------')
        도마.냉장고()

