import move_limit, rooms1, floor, item, 서랍칸

def 식탁():
    print(f'\n================================')
    print(f'현위치: 1층-《식당》')
    print(f'----------------------------------')
    print(f'【1】 식탁위')
    print(f'【2】 식탁아래')
    print(f'【3】 돌아가기')

    num = input('칸선택>> ')
    num = int(num)
    if num==1:
        print(f'\n================================')
        print(f'현위치: 1층-《식당》')
        print(f'----------------------------------')
        print(f'사용한지 한참은 된 것 같은 식탁이다. 그릇이 전부 깨져있다.')
        print(f'----------------------------------')
        식탁()

    elif num==2:
        print(f'\n================================')
        print(f'현위치: 1층-《식당》')
        print(f'----------------------------------')
        print(f'박살난 뼛조각들이 쌓여있다. 가끔씩 보이는 잇자국들로 보아 누군가 먹고 남은 것들을 버려둔듯 하다.')
        print(f'----------------------------------')
        식탁()

    elif num==3:
        print(f'----------------------------------')
        rooms1.show4()

def 트레이():
    print(f'\n================================')
    print(f'현위치: 1층-《식당》')
    print(f'----------------------------------')
    print(f'사람의 이빨로 보이는 것들이 몇 개 굴러다니고 있다.')
    print(f'----------------------------------')
    rooms1.show4()

def 의자():
    if (floor.count7 == 0):
        floor.count7 += 1
        print(f'\n================================')
        print(f'현위치: 1층-《식당》')
        print(f'----------------------------------')
        print(f'대부분이 박살이 났다. 『의자다리』 정도면 둔기로 사용할 수 있을 것 같다.')
        print(f'【item】 의자다리를 얻었다!')
        print(f'----------------------------------')
        hit_item = item.hit()
        hit_item.insert(2, '의자다리')

        rooms1.show4()
    else:
        print(f'\n================================')
        print(f'현위치: 1층-《직원휴게실》')
        print(f'----------------------------------')
        print(f'망가진 의자들 뿐이다.')
        print(f'----------------------------------')
        rooms1.show4()
