import sys

import move_limit, floor, item, 지하실3_5, 재단


def fish(): #관

    print(f'----------------------------------')
    print('재단 위에 금붕어를 올려두고 주문을 외우자, 어스름한 검은색 안개가 아래에서부터 새 나온다.')
    move_limit.lim3()
    print('검은색 안개는 점점 형태를 갖추었고, 거대한 크라켄의 발 같은 촉수 형태의 모양이 됐다.')
    move_limit.lim3()
    print('먹잇감을 가져가듯 시체를 촉수들로 감싸 다시금 아래로 사라졌다. 재단에 남은 건 아무것도 없다.')
    move_limit.lim4()
    print('촉수가 사라지자, 심장에서부터 격한 통증이 느껴진다. 안압이 높아져 눈이 빠질 것 같다. 뇌는 뜨거워져서 녹아내릴 것 같고, 고통에 생각이 마비된다. 뭐가 잘못된 거지? ')
    move_limit.lim3()
    print('사람의 언어가 아닌, 괴물의 목소리가 입 밖으로 흘러나온다. 곧 펑, 하는 소리와 시야 한쪽이 꺼진다. 온통 빨개진 시야를 느끼며 한쪽 손을 뻗었다. ')
    move_limit.lim3()
    print('바닥을 꿈틀거리는 게 사람이라기보단 구더기에 가까운 움직임이다. 머리카락이 뭉텅뭉텅 빠져 귀 옆을 지나가는 소리가 들린다. ')
    move_limit.lim3()
    print('뻗은 손에 눈의 초점을 맞췄다. 내 손. 원래 이렇게 끔찍했던가? 핏줄이 터질 듯이 팽팽해졌다. 입으로는 뜨겁고 비린 것들이 울컥울컥 쏟아져나왔다. ')
    move_limit.lim3()
    print('곧이어 암전.')
    move_limit.lim4()
    print('[END2] 괴물의 삶')
    print('주인공은 의식에 실패했습니다. 앞으로 그는 평생 누군가에게 목숨이 끊기기 전까진 의식도 없는 괴물로서 썩은 내를 풍기며 살아가야 합니다.')
    sys.exit("게임을 종료합니다.")


def piece(): #시체조각

    print(f'----------------------------------')
    print('재단 위에 시체조각을 올려두고 주문을 외우자, 어스름한 검은색 안개가 아래에서부터 새 나온다.')
    move_limit.lim3()
    print('검은색 안개는 점점 형태를 갖추었고, 거대한 크라켄의 발 같은 촉수 형태의 모양이 됐다.')
    move_limit.lim3()
    print('먹잇감을 가져가듯 시체를 촉수들로 감싸 다시금 아래로 사라졌다. 재단에 남은 건 아무것도 없다.')
    move_limit.lim4()
    print('촉수가 사라지자, 심장에서부터 격한 통증이 느껴진다. 안압이 높아져 눈이 빠질 것 같다. 뇌는 뜨거워져서 녹아내릴 것 같고, 고통에 생각이 마비된다. 뭐가 잘못된 거지? ')
    move_limit.lim3()
    print('사람의 언어가 아닌, 괴물의 목소리가 입 밖으로 흘러나온다. 곧 펑, 하는 소리와 시야 한쪽이 꺼진다. 온통 빨개진 시야를 느끼며 한쪽 손을 뻗었다. ')
    move_limit.lim3()
    print('바닥을 꿈틀거리는 게 사람이라기보단 구더기에 가까운 움직임이다. 머리카락이 뭉텅뭉텅 빠져 귀 옆을 지나가는 소리가 들린다. ')
    move_limit.lim3()
    print('뻗은 손에 눈의 초점을 맞췄다. 내 손. 원래 이렇게 끔찍했던가? 핏줄이 터질 듯이 팽팽해졌다. 입으로는 뜨겁고 비린 것들이 울컥울컥 쏟아져나왔다. ')
    move_limit.lim3()
    print('곧이어 암전.')
    move_limit.lim4()
    print('[END2] 괴물의 삶')
    print('주인공은 의식에 실패했습니다. 앞으로 그는 평생 누군가에게 목숨이 끊기기 전까진 의식도 없는 괴물로서 썩은 내를 풍기며 살아가야 합니다.')
    sys.exit("게임을 종료합니다.")


def daga(): #다가

    print(f'----------------------------------')
    print('재단 위에 시체조각을 올려두고 주문을 외우자, 어스름한 검은색 안개가 아래에서부터 새 나온다.')
    move_limit.lim3()
    print('검은색 안개는 점점 형태를 갖추었고, 거대한 크라켄의 발 같은 촉수 형태의 모양이 됐다.')
    move_limit.lim3()
    print('먹잇감을 가져가듯 시체를 촉수들로 감싸 다시금 아래로 사라졌다. 재단에 남은 건 아무것도 없다.')
    move_limit.lim4()
    print('툭, 하고 손가락 살이 뜯어졌다. 금이 간 것처럼, 굳은 껍질이 벗겨지는 것처럼...')
    move_limit.lim3()
    print('작았던 균열은 금새 몸 전체를 덮었고, 살이 생으로 갈라지고 뜯어지는 고통을 느꼈다.')
    move_limit.lim3()
    print('신체를 전부 갈아버리기라도 할 생각인지, 피부 겉껍데기가 벗겨지고, 제 기능을 하던 일부 부위도 전부 빠져나갔다.')
    move_limit.lim3()
    print('끔찍한 고통에 기절하지도 못하고 비명을 지르길 한참. 정신을 차리고 보니 몸은 예전 그대로의 모습을 하고 있다. 정말, 정말로 되돌아왔다.')
    move_limit.lim3()
    print('그 끔찍한 괴물이 되지 않아도 되는 것이다. 서둘러 자리에서 일어났다. 이 진절머리나는 저택에 남을 이유는 없다.')
    move_limit.lim3()
    print('지친다. 머릿속을 그 한 단어가 꽉 채웠다. 어서 돌아가자. 집으로...')
    move_limit.lim4()
    print('[END1] 평범한 일상 속으로')
    print('주인공은 의식을 성공적으로 마쳤습니다. 아무에게도 말하지 못할 만큼 터무니없는 말이지만, 뭐 어떤가요. 이젠 그동안의 시간을 보상받듯 푹 쉬기만 하면 됩니다.')
    sys.exit("게임을 종료합니다.")