import move_limit, rooms1, floor, item, 서랍칸
def 서랍():
    desk_list=[0,서랍칸.칸1,서랍칸.칸2, 서랍칸.칸3]
    print(f'\n================================')
    print(f'현위치: 1층-《직원휴게실》')
    print(f'----------------------------------')
    print(f'서랍을 열었다!')
    print(f'【1】 첫번째칸')
    print(f'【2】 두번째칸')
    print(f'【3】 세번째칸')
    print(f'【4】 돌아가기')
    num = input('칸선택>> ')
    num=int(num)
    print(f'----------------------------------')
    if num==4:
        rooms1.show3()
    else:
        desk_list[num]()



def 간이침대():
    print(f'\n================================')
    print(f'현위치: 1층-《직원휴게실》')
    print(f'----------------------------------')
    print(f'【1】 침대위')
    print(f'【2】 침대아래')
    print(f'【3】 돌아가기')

    num = input('칸선택>> ')
    num = int(num)
    if num==1:
        print(f'\n================================')
        print(f'현위치: 1층-《직원휴게실》')
        print(f'----------------------------------')
        print(f'스프링이 망가졌는지 매트리스가 푹푹 꺼진다. 검붉은 얼룩이 있긴 하지만... 만약 쉬어야 할 일이 있다면 여기로 와야할 것 같다.')
        print(f'----------------------------------')
        간이침대()

    elif num==2:
        if (floor.count6 == 0):
            floor.count6 += 1
            print(f'\n================================')
            print(f'현위치: 1층-《직원휴게실》')
            print(f'----------------------------------')
            print(f'『연장』들이 쌓여있다. 급하게 넣은 건지 어질러져 있다.')
            print(f'【item】 망치를 얻었다!')
            print(f'----------------------------------')
            floor.use_item.insert(1, '망치')


            간이침대()
        else:
            print(f'----------------------------------')
            print(f'쓸 수 없는 연장들이 어질러져있다.')
            print(f'----------------------------------')
            간이침대()

    elif num==3:
        print(f'----------------------------------')
        rooms1.show3()

def 옷장():
    print(f'\n================================')
    print(f'현위치: 1층-《직원휴게실》')
    print(f'----------------------------------')
    print(f'하녀복과 집사복이 들어있다. 곰팡이 때문에 입을 만한 옷은 아니다. 옷들 옆에는 청소 도구들이 세워져있다.')
    print(f'----------------------------------')
    rooms1.show3()

