import move_limit, rooms3, floor, item, 서재


def 신화서():
    print(f'----------------------------------')
    print(f'굉장히 낡아 보이는 책이다. 온갖 모독적인 존재들한 설명이 적혀져있다. 이건 인간이 받아들일 수 있는 영역이 아니다. 거대한 무언가가 날 쳐다보고 있는 느낌이 들었다.')
    print(f'----------------------------------')

    서재.책장()


def A의일기():
    print(f'----------------------------------')
    print(f'오래되어 보인다. 읽어도 되는 걸까?')
    print('읽어보면... 대부분의 종이가 뜯겨져있다. 눈물 자국이 군데군데 찍혀있다.')
    print(f'----------------------------------')

    서재.책장()


def 차원과시간():
    print(f'----------------------------------')
    print(f'굉장히 낡아보인다. 주인이 책장을 넘긴 흔적이 있다. 시간과 차원에 대한 말들이 전문 용어로 빼곡하게 설명되어 있다. 이해할 수 없다.')
    print("마지막 장에 '모래시계'라는 주문이 하나 적혀있다.")
    print('마력 1d10과 이성 2d10, 시간을 돌리려는 물체와 같은 물체를 필요로 한다.')
    print('사람의 경우 시체, 혹은 산 사람을 재물로 바쳐도 상관 없다.')
    print('피로 그린 재단 위에 재물을 올려두고 주문을 외우면 물체는 술자가 원하는 만큼의 시간을 역행한다.')
    print(f'----------------------------------')

    서재.책장()
