import move_limit, rooms2, floor, item
def 그랜드():
    if (floor.count8==0):

        print(f'\n================================')
        print(f'현위치: 2층-《피아노실》')
        print(f'----------------------------------')
        print(f'건반 사이사이에 피로 추측되는 무언가가 스며들어 있다. 뻑뻑하긴 하지만 누르면 눌리긴 눌린다.')
        #'여자'의 이름 '다가'를 순서대로 치면 된다.
        #(도) - (라)
        #-->>지하실열쇠얻음
        print(f'【다】 도')
        print(f'【라】 레')
        print(f'【마】 미')
        print(f'【바】 파')
        print(f'【사】 솔')
        print(f'【가】 라')
        print(f'【나】 시')
        print(f'【8】 돌아가기')
        print(f'----------------------------------')
        print(f'『음계를 타자로치자.(괄호안의 글자는 힌트입니다. 설마 힌트를 쓰진 않으시겠죠?)』')
        print(f'(돌아가기는 8번을 누르시면됩니다.)')
        num=input(f'건반입력>> ')
        if num=='도':
            print(f'\n================================')
            print(f'띵~..하는 소리가 났다. 건반하나만 더 치면될것같다.')
            print(f'----------------------------------')
            print(f'【다】 도')
            print(f'【라】 레')
            print(f'【마】 미')
            print(f'【바】 파')
            print(f'【사】 솔')
            print(f'【가】 라')
            print(f'【나】 시')
            print(f'----------------------------------')
            print(f'『음계를 타자로치자.』')
            num1 = input(f'건반입력>> ')
            if num1=='라':
                print(f'\n================================')
                print(f'띵~..소리와 함께 짤그랑 하고 무언가 떨어졌다.')
                print(f'【item】 지하실열쇠를 얻었다.')
                print(f'----------------------------------')
                floor.use_item.insert(2,'지하실열쇠')
                floor.count8 += 1
                rooms2.piano()
            elif num1=='라 ':
                print(f'\n================================')
                print(f'띵~..소리와 함께 짤그랑 하고 무언가 떨어졌다.')
                print(f'【item】 지하실열쇠를 얻었다.')
                print(f'----------------------------------')
                floor.use_item.insert(2, '지하실열쇠')
                floor.count8 += 1
                rooms2.piano()
        elif num=='도 ':
            print(f'\n================================')
            print(f'띵~..하는 소리가 났다. 건반하나만 더 치면될것같다.')
            print(f'----------------------------------')
            print(f'【다】 도')
            print(f'【라】 레')
            print(f'【마】 미')
            print(f'【바】 파')
            print(f'【사】 솔')
            print(f'【가】 라')
            print(f'【나】 시')
            print(f'----------------------------------')
            print(f'『음계를 타자로치자.』')
            num1 = input(f'건반입력>> ')
            if num1=='라':
                print(f'\n================================')
                print(f'띵~..소리와 함께 짤그랑 하고 무언가 떨어졌다.')
                print(f'【item】 지하실열쇠를 얻었다.')
                print(f'----------------------------------')
                floor.use_item.insert(2,'지하실열쇠')
                floor.count8 += 1
                rooms2.piano()
            elif num1=='라 ':
                print(f'\n================================')
                print(f'띵~..소리와 함께 짤그랑 하고 무언가 떨어졌다.')
                print(f'【item】 지하실열쇠를 얻었다.')
                print(f'----------------------------------')
                floor.use_item.insert(2, '지하실열쇠')
                floor.count8 += 1
                rooms2.piano()
        else:
            if num == '8':
                print(f'----------------------------------')
                rooms2.piano()
            else:
                print(f'\n================================')
                print(f'덜컹, 하는 소리와 함께 건반뚜껑이 순식간에 내려와 손을 짓눌렀다. HP -1')
                print(f'다시 한번 시도해보자.. 어딘가에 힌트가 있었을지도 모른다.')
                print(f'\n================================')
                그랜드()

    else:
        print(f'\n================================')
        print(f'현위치: 2층-《피아노실》')
        print(f'----------------------------------')
        print(f'소리가 잘 나지 않는 오래된 피아노일 뿐이다.')
        rooms2.piano()


def 바닥():
    print(f'\n================================')
    print(f'현위치: 2층-《피아노실》')
    print(f'----------------------------------')
    print(f'악보가 하나 놓여있다.')
    print(f'----------------------------------\n')
    rooms2.piano()


def 진열장():
    print(f'\n================================')
    print(f'현위치: 2층-《피아노실》')
    print(f'----------------------------------')
    print(f'유리가 다 깨져있다. 안쪽에 진열 되어있는 것들은 꽤 이름 있는 콩쿠르의 트로피.')
    print(f'----------------------------------\n')
    rooms2.piano()


